```
krishna@turbotindias-MacBook-Pro azure_check_logging % terraform apply
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.azure_postgresql_server_auditing will be created
  + resource "turbot_policy_setting" "azure_postgresql_server_auditing" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/serverAuditLogging"
      + value                        = "Check: Audit Logging > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_postgresql_server_auditing_checkpoints will be created
  + resource "turbot_policy_setting" "azure_postgresql_server_auditing_checkpoints" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/serverAuditLoggingLogCheckpoints"
      + value                        = "On"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_postgresql_server_auditing_connections will be created
  + resource "turbot_policy_setting" "azure_postgresql_server_auditing_connections" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/serverAuditLoggingLogConnections"
      + value                        = "On"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_postgresql_server_auditing_disconnections will be created
  + resource "turbot_policy_setting" "azure_postgresql_server_auditing_disconnections" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/serverAuditLoggingLogDisconnections"
      + value                        = "On"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_postgresql_server_auditing_duration will be created
  + resource "turbot_policy_setting" "azure_postgresql_server_auditing_duration" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/serverAuditLoggingLogDuration"
      + value                        = "On"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_postgresql_server_auditing_duration_days will be created
  + resource "turbot_policy_setting" "azure_postgresql_server_auditing_duration_days" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/serverAuditLoggingLogRetentionDays"
      + value                        = ">= 1 Day"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_sql_database_auditing will be created
  + resource "turbot_policy_setting" "azure_sql_database_auditing" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/databaseAuditing"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_sql_database_data_security will be created
  + resource "turbot_policy_setting" "azure_sql_database_data_security" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/databaseDataSecurity"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_sql_database_threat_protection_types will be created
  + resource "turbot_policy_setting" "azure_sql_database_threat_protection_types" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/databaseThreatProtectionTypes"
      + value                        = <<~EOT
            - SQL Injection
            - SQL Injection Vulnerability
            - Data Exfiltration
            - Unsafe Action
            - Access Anomaly
            - Brute Force
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_sql_server_auditing will be created
  + resource "turbot_policy_setting" "azure_sql_server_auditing" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/serverAuditing"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_sql_server_data_security will be created
  + resource "turbot_policy_setting" "azure_sql_server_data_security" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/serverDataSecurity"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_sql_server_threat_protection_types will be created
  + resource "turbot_policy_setting" "azure_sql_server_threat_protection_types" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/serverThreatProtectionTypes"
      + value                        = <<~EOT
            - SQL Injection
            - SQL Injection Vulnerability
            - Data Exfiltration
            - Unsafe Action
            - Access Anomaly
            - Brute Force
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_storage_queue_service_logging will be created
  + resource "turbot_policy_setting" "azure_storage_queue_service_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/queueServiceLogging"
      + value                        = "Check: Per Logging > Properties"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_storage_queue_service_logging_properties will be created
  + resource "turbot_policy_setting" "azure_storage_queue_service_logging_properties" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/queueServiceLoggingProperties"
      + value                        = <<~EOT
            - Read
            - Write
            - Delete
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_storage_queue_service_logging_properties_retention_days will be created
  + resource "turbot_policy_setting" "azure_storage_queue_service_logging_properties_retention_days" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/queueServiceLoggingPropertiesRetentionDays"
      + value                        = "7"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.azure_logging will be created
  + resource "turbot_smart_folder" "azure_logging" {
      + description = "Defines sets of policies for the Azure check logging baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "Azure Check Logging Policies"
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.azure_logging: Creating...
turbot_smart_folder.azure_logging: Creation complete after 2s [id=216522531367253]
turbot_policy_setting.azure_sql_database_data_security: Creating...
turbot_policy_setting.azure_storage_queue_service_logging_properties: Creating...
turbot_policy_setting.azure_storage_queue_service_logging: Creating...
turbot_policy_setting.azure_sql_server_data_security: Creating...
turbot_policy_setting.azure_sql_server_threat_protection_types: Creating...
turbot_policy_setting.azure_postgresql_server_auditing_disconnections: Creating...
turbot_policy_setting.azure_postgresql_server_auditing: Creating...
turbot_policy_setting.azure_postgresql_server_auditing_duration_days: Creating...
turbot_policy_setting.azure_storage_queue_service_logging_properties_retention_days: Creating...
turbot_policy_setting.azure_sql_server_auditing: Creating...
turbot_policy_setting.azure_sql_database_data_security: Creation complete after 2s [id=216522534263130]
turbot_policy_setting.azure_postgresql_server_auditing_checkpoints: Creating...
turbot_policy_setting.azure_sql_server_auditing: Creation complete after 2s [id=216522534790500]
turbot_policy_setting.azure_sql_database_threat_protection_types: Creating...
turbot_policy_setting.azure_postgresql_server_auditing_disconnections: Creation complete after 3s [id=216522534673759]
turbot_policy_setting.azure_postgresql_server_auditing_duration: Creating...
turbot_policy_setting.azure_sql_server_data_security: Creation complete after 3s [id=216522535275886]
turbot_policy_setting.azure_sql_database_auditing: Creating...
turbot_policy_setting.azure_storage_queue_service_logging: Creation complete after 3s [id=216522535266667]
turbot_policy_setting.azure_postgresql_server_auditing: Creation complete after 3s [id=216522535287153]
turbot_policy_setting.azure_postgresql_server_auditing_connections: Creating...
turbot_policy_setting.azure_postgresql_server_auditing_duration_days: Creation complete after 3s [id=216522535739774]
turbot_policy_setting.azure_storage_queue_service_logging_properties_retention_days: Creation complete after 3s [id=216522535695737]
turbot_policy_setting.azure_sql_server_threat_protection_types: Creation complete after 4s [id=216522535751042]
turbot_policy_setting.azure_storage_queue_service_logging_properties: Creation complete after 4s [id=216522535995783]
turbot_policy_setting.azure_postgresql_server_auditing_checkpoints: Creation complete after 2s [id=216522536113548]
turbot_policy_setting.azure_sql_database_threat_protection_types: Creation complete after 2s [id=216522536933777]
turbot_policy_setting.azure_sql_database_auditing: Creation complete after 2s [id=216522537100694]
turbot_policy_setting.azure_postgresql_server_auditing_duration: Creation complete after 2s [id=216522537185691]
turbot_policy_setting.azure_postgresql_server_auditing_connections: Creation complete after 2s [id=216522537251232]

Apply complete! Resources: 16 added, 0 changed, 0 destroyed.

Outputs:

smart_folder_description = Defines sets of policies for the Azure check logging baseline
smart_folder_name = Azure Check Logging Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher
krishna@turbotindias-MacBook-Pro azure_check_logging % 